[
{"title": "Hawaii Vacation Tips", "content": "Nov 06\n\t  Hawaii Vacation Tips\n\tNo Comments »\n\t  \n\t\t5 tips on vacationing in Hawaii\n\n\n\n1. Spend your time outdoors.\nIt goes without saying, that Hawaii, is beautiful beyond measure, so get out there and enjoy it. Wear sunscreen, buy some flip flops (In Hawaii, take note, we call them slippers) and go take a dip in the ocean, a hike up the mountain, what ever floats your boat! Literally even! You can float around on a tube, in the ocean and just relax. Yes!\n\n\n\n\n\n\n\n\n\n\n 2. Take a Hula lesson.\nWe make it super easy. All our lessons are scheduled on the day and time of our choice and because we have so many beautiful Hula dancers ready to provide your nest lesson, as long as you book a week in advance, we can guarantee availability. https://hawaiihulacompany.com/hula-lessons.html\n\n\nHawaii Hula Lesson\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3. Catch at least one sunset on the beach.\nSo mesmerizing to sit there watching as the sun sets creating colorful paintings in the sky…\nEven better with the sand in your toes and maybe even a glass of wine in your hand.\n\n \n4. Buy a pair of “Rubber Slippers” (Also known as flip flops).\nThis is how we get around in these parts, slippers of all kinds, everywhere. Enjoy the freedom of no shoes while you are here. Relish in the sun on your toes. And the beautiful part is if the get dirty or sandy, you can just hose them off!\n\n\n\n\n\n5. Hire Hula Dancers.\nIf you have a special event happening while you are here, why not add some beautiful Hula dancers to the mix? It is all about Hula in Hawaii. Our Hula dancers arrive in full costume and are professional in every way! The bright and bold beautiful colors in their costume, make any event pop! Fire knife dancers are also always a popular choice, The fire lights up the sky and people stand or sit amazed at this glorious show happening right before their very eyes! Try not to blink as our Fire knife dancers defy physics and gravity with their show stopping routines. http://www.hawaiihulacompany.com\n\n\n\n\n\n\n\n\n\t  5 tips on vacationing in Hawaii1. Spend your time outdoors.It goes without saying, that Hawaii, is beautiful beyond measure, so get out there and enjoy it. Wear sunscreen, buy some flip flops (In Hawaii, take note, we call them slippers) and go take a dip in the ocean, a hike up the mountain, what ever floats your boat! Literally even! You can float around on a tube, in the ocean and just relax. Yes! 2. Take a Hula lesson.We make it super easy. All our lessons are scheduled on the day and time of our choice and because we have so many beautiful Hula dancers ready to provide your nest lesson, as long as you book a week in advance, we can guarantee availability. https://hawaiihulacompany.com/hula-lessons.html\nHawaii Hula Lesson\nHawaii Hula Lesson3. Catch at least one sunset on the beach.So mesmerizing to sit there watching as the sun sets creating colorful paintings in the sky…Even better with the sand in your toes and maybe even a glass of wine in your hand. 4. Buy a pair of “Rubber Slippers” (Also known as flip flops).This is how we get around in these parts, slippers of all kinds, everywhere. Enjoy the freedom of no shoes while you are here. Relish in the sun on your toes. And the beautiful part is if the get dirty or sandy, you can just hose them off!5. Hire Hula Dancers.If you have a special event happening while you are here, why not add some beautiful Hula dancers to the mix? It is all about Hula in Hawaii. Our Hula dancers arrive in full costume and are professional in every way! The bright and bold beautiful colors in their costume, make any event pop! Fire knife dancers are also always a popular choice, The fire lights up the sky and people stand or sit amazed at this glorious show happening right before their very eyes! Try not to blink as our Fire knife dancers defy physics and gravity with their show stopping routines. http://www.hawaiihulacompany.com"},
{"title": "Lei: A Gift of Love", "content": "May 14\n\t  Lei: A Gift of Love\n\tNo Comments »\n\t  \n\t\tLei are often worn by Hula Dancers during performances. You have probably seen beautiful lei made of various colorful flowers, kukui nuts, t-leaf, shells or even seeds. In modern Hawaii, lei are often given at airports and special events to greet visitors. Natives of Hawaii give a lei to their loved ones for birthdays, graduations, special events, and celebrations.\nThe lei custom was introduced to the Hawaiian Islands by early Polynesian voyagers. In ancient Hawaii, lei were made of feathers, leaves, shells, flowers, nuts, seeds, and bones/teeth of various animals. Ancient Hawaiians wore these garlands to beautify themselves. Some lei had a significant meaning. The Maile lei, made of a green vine, was used to signify peace between opposing chiefs. The chiefs would intertwine Maile lei signifying peace between the two groups.\n       It is perfectly acceptable to wear a lei on any given day; there does not need to be a special occasion. A lei may be purchased from a store of a lei maker, or you may string one yourself. Lei may be worn around your neck, or even around a hat. A lei is a symbol of affection. Therefore, it is considered rude to refuse a lei when it is being given to you. It is also considered impolite to remove a lei from your neck in front of the person who gave it to you.\n\n \nToday the lei is a symbol of Hawaii to millions of visitors around the world. Hawaii Hula Company is proud to offer lei greeting for special events to welcome your guests in a unique way!\n\t  "},
{"title": "5 Reasons to Take a Hula Lesson", "content": "May 01\n\t  5 Reasons to Take a Hula Lesson\n\tNo Comments »\n\t  \n\t\tCongratulations! You booked the dream Hawaiian vacation, and you’re currently in the works of fine-tuning the details. How many islands should you visit? Where should you stay? Most importantly, what activities will you be partaking in? Experiences are what will stay with you forever and live on in your memories, so essentially it seems like the most vital part of the planning. If you’re deciphering on a cultural experience, a hula lesson is the perfect activity to complete any Hawaiian vacation. Our knowledgeable dancers will travel to you, teach you a bit of Hawaiian history, adorn you with accessories, and teach you a fun hula song.\nReasons to book a hula lesson:\n#1 When in Hawai`i……\nWhen in Hawaii you will experience many things special to our island culture. Although Hawai`i is a US State, it’s extremely different than being anywhere in the continental United States. You will have the opportunity to try authentic Hawaiian food with local favorites being laulau, kalua pig, lomi salmon, and poi. You will hear a different language- Pidgin is widely spoken by locals of Hawai`i; It is an official language. More and more Hawaiians are also practicing the Hawaiian language. You will also take note of our cultural dance- hula! Many hula halau practice in various parks, and you will see the cultural art form performed at many hotel poolsides and lobbies. It seems like the perfect opportunity to engage in such an activity.\n\n#2 The Bond….\nLearning about hula and having a hula lesson will forever bond you to the Hawaiian Islands. It will also develop a special bond with whomever you decide to take the lesson with. Years after your lesson you will be able to look at photographs and ponder about the unforgettable Hawaiian memories.\n\n#3 A Forever Souvenir…\nBeing able to get up at any given Hawaiian themed party and say: “I learned this in Hawai`i” is a gift that will stay with you forever. Thankfully, the 21st century allows you to have a video recording of the choreography on your phone just in case you forget.\n#4 The laughs…\nThroughout a hula lesson there will be a ton of laughs, jokes, and smiles. It never fails!\n\n#5 Local/Insider tips….\nDuring an hour hula lesson you’ll get to converse with the Hula Dancer. Ask him/her for recommendations on other authentic experiences. There’s no better way to Hawai`i than asking a native for advice.\nSo what are you waiting for? Our Hula Dancers are ready to show you a good time!\n\t  "},
{"title": "Pele- Goddess of Fire", "content": "Apr 15\n\t  Pele- Goddess of Fire\n\tNo Comments »\n\t  \n\t\tEvery Hula chant or song tells a story. Luckily, a Hula Dancer can portray the story with his/her hands, so you don’t need to be fluent in the Hawaiian language to understand the stories. A Hula Dancer can make you feel like you’re apart of the story through expressions and movements.\nThere are many Hawaiian chants inviting you to follow the adventures of Pele, the goddess of fire. Until this day, volcanic eruptions on Hawaii Island are attributed to Pele longing to be with her loved one. Some of the most popular Pele legends involve Pele and her lover Lohiau, a chief of Kaua`i, and Pele’s youngest and favorite sister, Hi`iaka.\nPele is said to be the most visible of the Hawaiian gods/goddesses as she dwells in the craters of the active Kilauea Volcano. The legends of Pele represent her as a very passionate and volatile goddess. She has the ability to create, as well as destroy land.\nThe spirit of Madame Pele is highly respected by natives of Hawaii. There are modern day stories of people believing to spot Pele. One story says drivers have seen an old woman dressed in all white on the roads of Kilauea National Park on Hawaii Island. The woman is said to be accompanied by a small dog. After drivers pick her up, they say the backseat is empty when they look back in the mirror. Locals also try to spread awareness about the importance of showing respect when visiting the lava fields. People of Hawai`i frown upon taking lava rocks from the volcanoes. There was a very recent story in 2016 of an American family who took handfuls of lava rocks and black sand from the Big Island. After feeling “cursed” they contacted the local airlines they flew with and had the stolen items retuned to Madame Pele.\nKumu Hula (teachers) often take their haumana (students) to visit places which their mele (songs) and chants come from. The more a dancer understands what they’re dancing about, the better they can express it. The legends of Hawaii’s gods and goddesses are fascinating, and can be best experienced through the art of Hula.\n\t  "},
{"title": "Perpetuating the Hula", "content": "Apr 01\n\t  Perpetuating the Hula\n\tNo Comments »\n\t  \n\t\tWhat may be considered the most prestigious hula event of the year, The Merrie Monarch Hula Festival, will be occurring in just a few short weeks. Hula Dancers around the world will be tuning in to catch the competition live. The competition can be viewed live in person from Hilo Hawai`i, online from anywhere in the world, or on television from anywhere in Hawai`i.\nThis year, the festival kicks off on April 16, 2017. The festival honors King David Kalakaua (the last king of the Kingdom of Hawaii,) whose nickname was “The Merrie Monarch.” King Kalakaua is well known and celebrated in the Hawaiian Islands for restoring the Hula after it was banned by the missionaries.\nThe Merrie Monarch greatly impacts the Hawaiian people as it perpetuates our traditional Hawaiian culture. The competition strives to share high quality performances with interested people around the world. Hula Dancers train and practice for extensive amounts of time before they showcase a song. The Merrie Monarch represents a celebration of Hula, and fosters an appreciation of dance in our future generations.\nThe competition officially begins on Thursday with the soloist category. 10 women, from 10 different Halau (hula school) will be competing to become Miss. Aloha Hula, your modern day “Hula champion.” On Friday all of the groups will dance their chosen Kahiko (ancient/traditional) number, and on Saturday each group will perform an auana (modern) number. Each student is taught that it’s an honor to enter the competition, and that it’s more about representing your kumu (teacher) to your best ability rather than winning.\nWill you be tuning in to partake in the Merrie Monarch festivities, or will you be attending the festival in person?\n \n\t  "},
{"title": "Confessions of a Hula Dancer", "content": "Mar 15\n\t  Confessions of a Hula Dancer\n\tNo Comments »\n\t  \n\t\tDancing in a Hula Halau (Hula school) teaches you many wonderful things. Believe it or not, the art of Hula is not the most important thing you learn during your time in a Hula Halau.\nImagine this: It’s 11:00 am on a Saturday morning and it’s time for practice. All of the other haumana (students) are in line ready to go, but you are stumbling out of your car because you left your house 5 minutes late. Practice begins, and you are now officially late. Out of respect for your Kumu (teacher,) you pull yourself together and calmly walk over to the Halau where you need to oli (Hawaiian chant) permission to enter. You do the oli 3 times in a row, but because your Kumu is busy with the punctual students, you take a deep breath and do it again; this time chanting louder with more power in your voice. Your Kumu finally gives you permission to enter the Halau. *Note to self- Always be punctual\nWe begin with a Hula warm-up that we call “basics.” We practice our basic steps and our Kumu helps us make corrections as needed. This is to help fine-tune our skills. Your knees are bent and after an intense 30-minute drill they start to ache. You think you’re finally done and you’ve made it, when it’s announced that the final basic drills involve the dreaded o`opa (duck walk,) and the infamous Hula roll (A Hula roll involves sitting in between your legs on the ground and rolling your body around in a circle without the use of your elbows.) Your body feels like it could break. Your knees are shaking, and you start to get light headed as you power through these dreaded drills that are necessary to shape you as a dancer. *Note to self- You are stronger than you think; you can do anything you set your mind to.\nIn a Hula Hulau you are surrounded by tons of children who may be older than you, younger than you, and the same age as you. These are the people you rely on during practices, shows, and competitions. You grow so close to one another that you refer to each other as Hula brothers and Hula sisters. These children teach you teamwork, trust, and eternal love. They say once the stage lights come on dancers become multiple souls in one body. That’s because dancer’s movements should be in complete precision. Basically, when we dance Hula together, we are one. *Note to self- Always strive for your best; your brothers and sisters are counting on you.\nHula dancers are raised with respect for the Hawaiian culture, the land, and for all living things. Hula dancers learn discipline, and tend to have polite mannerisms. Hula dancers are raised with the strong Hawaiian value of aloha (love!) To be a great Hula dancer one must not only dance to make their Kumu (teacher) proud, but one must also exude the values and strength of a true Hula dancer.\n \n \n \n\t  "},
{"title": "Hula Throughout the World", "content": "Mar 02\n\t  Hula Throughout the World\n\tNo Comments »\n\t  \n\t\tHula, which originated in Hawaii, has been gaining popularity in various parts of the world. People are developing a deep love for the dance of the Hawaiian people, and the beautiful Hawaiian stories told through this form of art.\nIn the United States you can find Hula Halau (Hula schools) throughout the states. There are an abundance of Halau across the Hawaiian Islands, but you may be surprised at the number of states that foster the art of Hula. Hula schools are also located in Alaska, Arizona, California, Florida, Georgia, New York, North Carolina, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Virginia, Washington, West Virginia, Wisconsin, and Wyoming to name a few.\n\nInternationally, you will find Hula Halau in French Polynesia and New Zealand, which are close Polynesian cousin of Hawaii. You will also find Hula schools on their neighboring continent of Australia. In Asia you will find large, growing numbers of Hula schools in Japan, as well as Taiwan, Hong Kong, Indonesia, and Singapore.\nSurprisingly, the countries that border the USA, Mexico and Canada, both have large numbers of hula schools. Mexico has more than 100 Hula Halau. Their love of Hula has overwhelmingly grown in recent years. They even have their own hula competitions, and fly in professional Hawaiian Hula Dancers and Kumu Hula (teachers) to be judges.\nOn the other side of the world, In Europe, you will also find many Hula schools. Halau can be found in Finland, France, Germany, Italy, Netherlands, Norway, Portugal, Spain, and Switzerland. As far away as the Caribbean, people can learn how to dance hula at a halau in the Dominican Republic. In South America, Brazil even has a couple of Halau.\nAs a Hawaiian and a Hula Dancer, I feel overwhelmingly proud to see the love of hula growing around the world. There was a time period where my great, great grandparents practiced Hula and the Hawaiian language in secrecy because missionaries outlawed it. Today, I’m able to proudly perform this dance for locals and tourists in Hawai`i, as well as various cities around the world. People fall in love with hula for various reasons. For me personally, hula is apart of me. I don’t just dance hula; I’m a hula dancer.\n\t  "},
{"title": "Who are Hula Dancers?", "content": "Feb 18\n\t  Who are Hula Dancers?\n\tNo Comments »\n\t  \n\t\tWould you believe that Kamehameha Schools, a school for Hawaiian children, is one of the most diverse schools in the world? You must be wondering how that’s possible. It all started back when the sugar cane plantations developed in Hawai`i. Plantation owners were Caucasian while laborers came over from Japan, China, Portugal, Korea, Puerto Rico, and the Philippines.\nHapa Hula Dancers\nNaturally, the children of Hawai`i began to represent a diverse melting pot of the cultures represented on the islands. Today, most Hawaiian children are mixed with handfuls of other ethnicities. When driving towards the “all Hawaiian school” you’ll see beautiful children with varying skin tones, eye color, hair color, and builds; yet they are all Hawaiian. A term was coined to identify such a diverse group of people. Hapa means mixed. Originally it came from the term “Hapa Haole,” which meant half Hawaiian and half “white foreigner.”\nHawaii Hula Company’s beautiful ladies on set of Vacation Creation TV show\nToday the term “Hapa” is widely used throughout the Hawaiian Islands to identify people with a variety of ethnic backgrounds.\nToday’s Hula Dancers reflect the diversity of Hawai`i. I myself am a proud Hawaiian, but I also have 12 other ethnicities including Puerto Rican, Portuguese, Cherokee Indian, Spanish, and Irish. As hula spreads throughout the world, dancers even come to Hawai`i from the U.S. Mainland, or various Asian countries to pursue their dreams as Hula Dancers.\nHula Dancer\nHula Dancers have a love for Hula as well as the Hawaiian culture. King David Kalakaua once said: “Hula is the language of the heart, therefore the heartbeat of the Hawaiian people.” Hula is even taught to the children of Hawai`i in public and private schools. The ongoing tradition of May Day allows children to learn and dance hula in schools and perform in front of one another.\nSo who are Hula Dancers? Simply put, Hula Dancers are Hawaiian, not Hawaiian, Born in Hawai`i, not born in Hawai`i, children of the islands, mothers, fathers, brothers, sisters, aunties, uncles, grandmas, and grandpas. The art of Hula doesn’t turn anyone away. It is a dance filled with deep culture and love.\n \n\t  Hapa Hula DancersHawaii Hula Company’s beautiful ladies on set of Vacation Creation TV showHula Dancer"},
{"title": "A Day in the Life of a Professional Hula Dancer", "content": "Feb 02\n\t  A Day in the Life of a Professional Hula Dancer\n\t1 Comment »\n\t  \n\t\tMany professional Hula Dancers of Hawai`i spend their day performing at multiple events, engaging with people from around the world, and graciously sharing the aloha spirit. A Hula Dancer’s day is usually filled with happiness and joy, as we are able to celebrate many special occasions, and be apart of people’s noteworthy moments. Allow me to take you on a walk through my day.\nMy day started at sunrise down on the beach where the ocean meets the sand. As the sun rose, and the birds chirped, I danced to the sweet sound of my favorite musician playing his ukulele. After my opening hula I watched 6 couples, from 6 different countries, renew their vows as they openly shared their love for one another. The sunrise vow renewal ceremony gave my body more caffeine than a cup of my daily Starbucks.\nFollowing the early morning start I treated myself to a beautiful Hawaiian hike before my next gig. A few hours later, I met up with two of my closest friends to dance as a trio at one of O`ahu’s secluded, high-end hotels. We shared the stage with three of our usual, talented musicians. The six of us worked together to deliver a high-energy show. After the show we were invited to eat the left over food and mingle with our guests, who came from Australia. They were celebrating a 25th wedding anniversary. Having recently traveled through Australia, we had a ton to converse about. We shared travel tips, and wished them well before heading down to end the evening at the well-known Waikiki strip.\nAs I pulled into my last gig of the evening at a prestigious Waikiki hotel, fireworks going off over the ocean greeted me. Although I grew up about 10 minutes from Waikiki, the magic of Waikiki that you hear about in many Hawaiian songs never gets old. I met up with two of my musicians excited to begin my last show of the evening. After my first hula a pair of adorable sisters approached me. The girls were dolled up in Hawaiian print dresses with flowers in their hair. Although they were both under five years old, they were extremely friendly and conversational. We became an instant group of besties, and they decided to sit with me until my next set. Their polite parents were worried that they were in the way, but I insisted they were just fine. When I went up for my second set I surprised the girls by calling them up to do a hula with me. Their parents smiled and recorded their daughters dancing a song about seashells under the bright Hawaiian moon. As a hula dancer, one of the things I value most is the happiness I’m able to share with others, and these girls couldn’t contain their smiles.\nThe day of a Hawaiian performer is typically fueled by passion, energy, laughter, the love of people, and dance. The next time you see a Hula Dancer’s radiant smile you’ll be able to relate to his/her daily experiences, and know that you are contributing factor to that display of pearly whites.\n \n\t  "},
{"title": "Aloha Spirit", "content": "Jan 15\n\t  Aloha Spirit\n\tNo Comments »\n\t  \n\t\tThe meaning of aloha is much deeper than a greeting. Although aloha means hello, goodbye, and love; essentially it’s a way of life. Aloha spirit is exuded throughout the Hawaiian Islands. Aloha spirit is a guideline to act rightfully. Visitors often express that they can feel aloha as soon as they arrive in Hawai`i. Literally translated, aloha is “the presence of breath,” or “the breath of life.” “Alo” means presence, and “ha” means breath.\nHula is an expression of aloha\nHaumana (students) are taught about aloha from a young age at their halau (hula school.) It is a hula dancer’s kuleana (responsibility) to understand the meaning of aloha in order to share it with others. When a hula dancer presents you with a lei (flowers/shells strung together to be worn,) he/she is sharing a symbol of affection, and is genuinely welcoming you with open arms.\nGiving a lei is a symbol of aloha\nIn ancient Hawai`i, kahuna (priests) embedded the spirit of aloha in the Hawaiian people. It was said that self-perfection could be reached by fully living by the spirit of aloha. The Hawaiians lived in harmony within their ahupua`a (land division,) each perfecting their skills and sharing everything with one another.\n\nInterestingly enough, not only has the aloha spirit been kept alive and well in Hawai`i, but it is also a law. That’s right! Aloha spirit is an official law in the state of Hawai`i. The official Aloha Spirit Law can be found in section 5-7.5. The law states: “All citizens and government officials of Hawaii are obligated by law to conduct themselves in accordance with this law, while performing their duties and obligations, as well as in their day-to-day living. Likewise, those visiting our fair islands are expected to conduct themselves in accordance with this Hawaiian law.”\nNow that you’re familiar with the spirit of aloha it’s time to book your plane ticket and experience the spirit of aloha first hand.\n\t  Hula is an expression of alohaGiving a lei is a symbol of aloha"},
{"title": "Polynesian Dances", "content": "Jan 01\n\t  Polynesian Dances\n\tNo Comments »\n\t  \n\t\tThe beautiful and cultural islands of Polynesia have many forms of song and dance. However, each dance is associated with a specific island group, and is special to a specific culture. Hula comes from the islands of Hawai`i, Tahitian derives from the islands of Tahiti, the Haka and Poi Balls originated in New Zealand, and fire knife dancing comes from Samoa. Although these dances may often be seen performed back to back in a Polynesian show, they are unique, and represent various cultures.\nHula Kahiko\nHula is the dance of the Native Hawaiians. You may see beautiful graceful Hula Auana, or strong and powerful Hula Kahiko. Legend says that the Hula was originally performed for Pele, the goddess of fire, by her sister, Hi`iaka. Many Hula chants are an oral record of the history of Hawai`i. The Hula has greatly changed over the years, but its’ ancient roots are still portrayed in the dance. After the arrival of missionaries on the Hawaiian Islands in 1820, hula was banned. Although the dance was somewhat revived years later for the purpose of religious freedom, King David Kalakaua is credited for the full revival of the hula during his reign between 1874-1891. The art of Hula is credited for preserving the culture of the Native Hawaiians. Hula is well respected throughout the Hawaiian Islands, and can be seen at various events.\nTahitian Dancers\nOri Tahiti (Tahitian dance) is the dance of the Tahitian people. You may see the Otea, which consists of gyrating hip movements to drumming, or the Aparima, which tells a story through song. Tahitian people are known to love song and dance. In ancient times, the native people of Tahiti would perform various dances for special occasions. There was a dance to greet visitors at a ceremony, dances for prayer and worship, and other dances dedicated to ancient gods. Similar to the history of Hawai`i, upon arrival of the missionaries, they banned all songs, games, and dances- as they viewed them as vulgar. Ori Tahiti wasn’t revived until the 1950’s; over a hundred years after it was suppressed by British colonists. Tahitian dance is well and alive today. Many people consider the Tahitian O`tea one of the most spectacular dances of Polynesia.\nThe Haka is one of New Zeland’s traditional dances. There are many forms of the Haka. One of the most popular is the “Ka Mate.” The Haka portrays strong, war like gestures. Historically, the Haka was performed for a variety of purposes ranging from preparing for battle to funeral services. Another dance of the Maori people is called Poi. Poi balls are weighted balls connected to string. They can be long or short. Poi tells a story while the dancer creates rhythmic and geometric patterns with the poi balls.\nFire Knife Dancer\nThe fiery fire knife dance comes from Samoa. It has been passed on from generation to generation. The dance involves the brave twirling of a war knife. Traditionally the dance was used in ancient time to prepare a warrior’s mind for battle. Today’s fire knife dancers have added additional style and boldness to their performance.\nAlthough the islands of Polynesia may share some similarities, each island is unique, having many differences. The dances of each specific island is special to its’ people. Each dance is distinguished and beloved by its’ specific culture.\n\t  Hula KahikoTahitian DancersFire Knife Dancer"},
{"title": "Hula Costumes", "content": "Dec 14\n\t  Hula Costumes\n\tNo Comments »\n\t  \n\t\tJust as you would dress accordingly for the weather, a Hula Dancer dresses accordingly for the type of song he or she performs. Costumes are an immense part of preparing for any performance. Just as a dancer’s hands and expressions tell a story, a costume is supposed to enhance that story, and help bring it to life. Costumes range from traditional hula skirts to elegant dresses, to brightly colored cellophane skirts.\nPerforming a traditional Hula Kahiko\nHula Kahiko: The Hula Kahiko is the traditional style of dance. Originally, only men would perform the Hula, but today both men and women enjoy dancing. Kahiko is performed to chants instead of music. The chants are usually accompanied by a pahu (drum) or an ipu (hollowed gourd) to keep the rhythm. Men often wear a malo (loincloth) while performing Hula Kahiko while women typically wear voluminous skirts. The Hula Kahiko is a very powerful dance that requires strength and discipline from the dancer. The chants often speak about Hawaiian legends and gods. Kahiko adornments are made from foliage and are typically worn around a dancer’s head, neck, wrists, and ankles.\nPerforming a modern Hula Auana\nHula `Auana: The Hula `Auana the modern style of dance performed by both men and women. The mele (songs) are accompanied by musical instruments such as `ukuleles and guitars. Men wear aloha shirts with slacks, or may go shirtless. The women wear gorgeous, long flowing dresses or t-leaf skirts. Hula `Auana dancers will be adorned with beautiful flowers in their hair and around their neck. This particular style of dancing is soft and graceful. Through the art of Hula `Auana, the dancer is able to tell an entire story through the use of his/her hands.\nPreparing for a Hapa Haole Hula set\nHapa Haole: Hapa Haole Hula is a form of entertainment that became popular in the 1940’s. The songs are sung in English and accompanied by modern instruments. Hapa Haole tunes are usually upbeat and a tad playful. Dancers may wear brightly colored cellophane skirts, grass skirts, or knee length dresses adorned with flowers.\nRegardless of what type of Hula a dancer is preparing for, he/she takes great pride in appearance, and representing the song/chant well.\n \n\t  Performing a traditional Hula KahikoPerforming a modern Hula AuanaPreparing for a Hapa Haole Hula set"},
{"title": "Professional Hula Dancers", "content": "Nov 30\n\t  Professional Hula Dancers\n\tNo Comments »\n\t  \n\t\tThose who have experienced the magic of a true Hawaiian Hula show often leave feeling mesmerized and pleased. However, many often question what it takes to be a professional Hula Dancer. The truth is, anyone who decides to enter the realm of professional hula dancing has a great passion for the unique, complex art form, and is eager to share the love of Hula with locals and visitors, alike.\nThe Ladies of Hawaii Hula Company\nHula is taught in a halau, which is a school for Hula. Children as young as two attend classes where both Hula Kahiko (ancient style of dance) and Hula ‘Auana (modern style of dance) are taught. Students in a halau form a close bond with their Kumu Hula (teacher) as well as the other students, which they refer to as their hula brothers and sisters. Years upon years of practice provide haumana (hula students) with the discipline, knowledge, and aloha they need to be successful Hula Dancers. Many halau perform at community events and festivals or train for Hula competitions to showcase their learning.\nHula Halau focus on hula basics. It is not uncommon for students to practice a basic skill until their kumu is satisfied with their performance. Students will also practice the same songs and chants repeatedly to perfect them.\nHula dances may be performed with a dancer’s hands, or utilizing implements. The most common implements are the ‘uli’uli (Hawaiian feathered rattles,) pu’ili (split bamboo sticks,) and ipu (hand held calabash gourd.) However, dancers may also utilize kala’au (dancing rhythm sticks,) ‘ili’ili (smooth lava rock castanets,) or a puniu (knee drum.)\nAloha from Oahu’s brand new mall, Ka Makana Ali’i\nNext time you’re gazing at a group of Hula dancers wondering how they learned how to dance, how long they’ve practiced for, or what made them become a professional Hula Dancer, just know it took them a lot of heart and soul as well as many years of dedication and determination. Hula becomes such a great part of a dancer that it becomes who they are instead of what they do. Most importantly, not only does a Hula Dancer share his/her culture and passion with you when they perform for you, but they also joyfully share a piece of themselves.\n \n \n\t  The Ladies of Hawaii Hula CompanyAloha from Oahu’s brand new mall, Ka Makana Ali’i"},
{"title": "A Day in the Life of a Hawaiian Wedding Musician", "content": "Sep 01\n\t  A Day in the Life of a Hawaiian Wedding Musician\n\tNo Comments »\n\t  \n\t\tA Day in the Life of a Hawaiian Wedding Musician;  A blog entry from one of our Hawaiian Musicians…\n \nSo there I was…back on Oahu after my Hawaii Hula Company gig on Maui, gearing up for my engagement with a wedding couple in Waikiki. I just love singing for weddings! Everyone is so happy, love is in the air, and many eyes are misty with joyful smiles. My eyes often get misty and I have to remind myself that Iʻm working! What a contrast! because thats really why its called “playing” music!\nAfter the work it takes to rehearse and learn those special love songs, like the Hawaiian Wedding Song, we play like its no work at all! And actually… by the time we rehearse our Hawaiian Love Songs to perfection, it never appears to be work! Go figure!\nSolo Hawaiian Wedding Musician\nI usually perform with my guitar in Hawaiian Style Slack Key, but this time the wedding couple requested that their Hawaiian Wedding Musician perform with an Ukulele. Not a problem for me, because the Ukulele was one of my first instruments. Thing is… after returning to Oahu, I suddenly remembered that my Ukulele was still on Maui! Luckily, I was able to borrow my granddaughters Ukulele and all was well in my world again. Mahalo nui granddaughter!\n\n \nIt was a typical busy Waikiki day with traffic lights, road work, lots of people, parking… then I finally arrived at the wedding location selected by the bride and groom.\nIt was a sweet private family affair. The wedding couple had chosen a lovely alcove away from the hustle bustle, under a lovely bower of colorful bougainvillea. Family members present, photographer present, officiant arrives, all is in place. Special songs for a special day…Hawaiian Wedding Music begins.\n\nWith anticipation we all wait for the arrival of the bride and grooms sweet flower girl. She was just adorable as she accentuated the walkway with her flower petals, leading the way in for the bride, and taking her place with the bridal party.\nLovely Flower Girl\n\n\nMy song selections included the traditional Hawaiian Wedding Song entitled Ke Kali Nei Au, a most appropriate processional for the bride. Some of the other songs played included:\n\nE Maliu Mai, e Kuʻu Ipo – Listen To My Call, My Sweetheart.\nWhite Sandy Beach. \nA Song of Old Hawaiʻi. \nHilo Bay. \nI’ll Weave a Lei of Stars for You. \nAkaka Falls.\nA beautiful couple, beaming with love for one another. What a wonderful afternoon!\n\t  Solo Hawaiian Wedding MusicianLovely Flower Girl"},
{"title": "Tips for hiring Musicians and Hula dancers for your wedding", "content": "Aug 01\n\t  Tips for hiring Musicians and Hula dancers for your wedding\n\tNo Comments »\n\t  \n\t\tCongratulations! You are engaged and now dreaming about how to make your special day your own. Once your have chosen your venue, choosing Entertainment can be next up on the list… \n \nHire Hula dancers and Musicians for your wedding here\nIt is so important to us at Hawaii Hula Company that our clients be a part of creating exactly the kind of entertainment they have in mind for their special day. After all, a wedding is an occasion that celebrates 2 individual people forming a special union.\nIt should be about the both of you, your preferences and your style.\nWe welcome your requests!\nThis is why at Hawaii Hula Company, we do not offer “packages” for which our clients must fit into or choose from. We encourage you to create your own vision for entertainment and we, are here to help guide you. We offer a variety of services including but not limited to:\nHula dancers\nTahitian dancers, Hawaiian Musicians\nPolynesian Musicians\nFire knife dancers\nPolynesian Drummers\nSound System with technician\nLei presentations\nHula Dancer\n \nNow… lets talk about your wedding day plans! \nBooking Hawaiian Music is really easier than you think. First of all, we do all the work for you.\nYou just need to know what youʻd like to enjoy and share with your guests on your special romantic day.\n\n \nHawaii Hula Company can provide all the entertainment your heart desires, to create everything from a sweet private ceremony, to a larger event on the beach, to a grand hotel ballroom, or a spacious outdoor location.\nHere are a few guiding tips to help you decide what to book. If youʻre on the beach or a larger open area, consider making the wise decision to include a sound system and lighting, if needed (depending on the time of day).\n\nThe amount of sound you need will be determined by the number of Musicians and Audience size (Anything over 25 people, sound should be considered).\nIf you also wish to hire Hula Dancers for your reception, its a good idea to have as many dancers as musicians on stage. This creates a balance between the amount of musicians and the amount of hula dancers for that perfect balance on stage.\nAnother thing to keep in mind is…what kind of music you are looking to have. Traditional Hawaiian, Contemporary Hawaiian or a mix of both?\n \nAudience Participation: Bridal Hula Lesson\nOur Wedding Musicians and Hula Dancers are professionals who arrive early, complete with costumes, flowers, and aloha, all together to deliver the very best of their talents and knowledge from years spent perfecting their craft. You and your guests will surely be the recipients of excellence in their performances, helping you create wonderful memories for years to come.\n\t  Hire Hula dancers and Musicians for your wedding hereWe welcome your requests!Hula DancerAudience Participation: Bridal Hula Lesson"},
{"title": "Family Hula Lessons", "content": "May 15\n\t  Family Hula Lessons\n\tNo Comments »\n\t  \n\t\tFamily vacations are so much fun because the experiences you share will last your life time. If you are visiting Maui, Oahu, or Hawaii island with your family, you’re probably researching all of the different activities you could do all together. You might want to do something where everyone can be involved and learn something new about the Hawaiian culture. Well, a hula lesson with Hawaii Hula Company is your answer.\nAs a hula instructor, I know that families who have shared the hula lesson have had a special bonding experience. The hula lesson, is a perfect way for families visiting to engage in “aloha”. The hula is not only for girls. In old Hawaii, the hula was practiced as a way for Hawaiian warriors to tell the story of certain battles. Hula is fun for boys, girls, babies, parents or grandparents.\nFun for the whole family\nOur hula instructors come prepared with flowers and leis, which is the essence of a true Hawaiian experience. The strong scent of the flowers and the\nFlowers, Family, and Fun\nMaking Lei and Rosettes\nactivity involved in making a hair piece or lei is peaceful and relaxing. Families share this time learning more about the Hawaiian culture. They also experience a little of what old Hawaii was like, when things were simple, when families had time to sit, talk, and make things together. In old Hawaii, families did similar together, like making rope, pounding kapa, or preparing tools for the following day.\nAfter spending some time making flower adornments, the family will get to learn a beautiful hula song. The instructor will teach the lower part of the bodies movements. Then you will learn the hand motions that will represent the words in the song. Learning to use your body parts in the hula is a challenge that will bring a smile to everyone’s face. After learning the feet movements and the hand motions, the family will have fun doing the entire song.\n \nThere is no comparison like learning the hula in a private setting compared to learning a quick and rushed song at a lu`au. Your hula instructor is there to teach you at your pace. You can learn the meaning of the song. You can learn reasons why your hands move in specific ways. Your hula instructor is your friend and is there to answer all of your hula questions.\nHawaii Hula Lesson\nSo, the next time you plan a visit to the Hawaiian Islands, check out a hula lesson, from the Hawaii Hula Company. It will be one of the best Hawaiian experiences of your lifetime.\n\t  Fun for the whole familyFlowers, Family, and FunMaking Lei and RosettesHawaii Hula Lesson"},
{"title": "Hawaii’s Hula Restored", "content": "Apr 15\n\t  Hawaii’s Hula Restored\n\tNo Comments »\n\t  \n\t\t \n \nHula by the ocean\nWhen you think of Hawaii, one of the first things that will pop into your mind is the image of a Hula dancer, dancing effortlessly to sound of pleasant Hawaiian music.  It brings you to a sense of peace and utmost relaxation.  As you close your eyes, you begin to feel the tropical breeze that lifts soft drops of salty water to your face and the smell of flowers from the hula dancer’s adornment. Surfing, hiking, and snorkeling come second to enjoying the unique form of dance known as the Hula.\n\nHowever, the strange truth is that the hula was once abolished from the public eye.   Missionaries in the 1820’s, shared their opinions on Hula, saying that it was offensive and suggested that Hawaiians rid their “heathen” past.  The Hula wasn’t seen in public for some 50 years. Thankfully, it was still practiced in private hiding from those who opposed it.  It was Hawaii’s last King, King Kalakaua who restored Hula and encouraged it to be performed for numerous public occasions.  It began with his 50th birthday celebration that lasted over two weeks with hula as a main source of entertainment.  He truly was a Merrie Monarch.\nLovely Hula Lady\nIn honor of his virtuous act to showcase Hula once again to the world, the famous event known as The Merrie Monarch Festival began and takes place once a year in the town of Hilo.  At this event thousands of hula teachers, known as kumu and their hula dancers, known as haumana come to participate in a hula competition.  It lasts three days, focusing on the traditional Hula known as Kahiko and the Modern Hula known as Auana. This is such an event, each year, halau (Hula schools) from all over the world fly into Hilo for it. The energy is intoxicating and the air is filled with the fragrant smells of all the lovely pua (flowers) being used by Hula dancers and spectators alike!\nIf you haven’t been it is a must for anyone who really loves Hula.\nHawaii Hula Company Hula Dancers\nMale Hula Dancer\nThe art of hula is so unique and is such a treasure to Hawaii and the world.  The hula represents life in Hawaii’s past, the present and the future.  It is truly special to still see it performed today. We at Hawaii Hula Company strive to share Hula with the world, one event at a time. We offer Hula dancers, Tahitian dancers, Musicians and Fire knife dancers for any event on Maui, Oahu and Hawaii Island.\nPlease give us a call at 808-646-1455 or email us at info@hawaiihulacompany.com to talk about how we can bring Hula and a bit of Hawaiian culture to your event.\n\t  Hula by the oceanLovely Hula LadyHawaii Hula Company Hula DancersMale Hula Dancer"},
{"title": "How To Plan Your Hawaiian Wedding", "content": "Jan 26\n\t  How To Plan Your Hawaiian Wedding\n\tNo Comments »\n\t  \n\t\tFor many brides-to-be and their grooms, having a beach wedding in Hawai’i or getting married in Hawai’i is a dream- but you want every aspect of your special day to be as culturally inspired as possible.  In ancient Hawai’i, marriage between a man and a woman, called ho’ao pa’a, was a lasting relationship.  The parents of the boy and girl discussed the idea and made sure the marriage was suited.  Once they felt confident the couple began preparation for marriage and learning the certain skills to prepare them for a lasting life together.  Once completed the parents of both the boy and girl commanded them to take care of each other, they embraced (honi), and they became husband and wife.  During and after the wedding ceremony, hula is usually performed symbolizing the unity of husband and wife.  The Hawaiian Wedding Song, “Ke Kali Nei Au” which was made popular by Elvis Presley is a great symbolic song to be performed.  Hula represents love and the aloha spirit and to share that at your ceremony or reception is a dream.\n\nIn ancient times hula was only performed by the kane or male dancers nowadays the wahine or woman have taken over the art form.  Having both kane and wahine perform is a sight to see, wahine of course is very elegant and graceful and the kane makes the dance powerful and edgy.  Combining both aspects gives the audience a show and it is well versed for everyone.\n\nAccompanying the dancers are musicians. In Hawaiian music trios are the most popular form to book.  A trio consists of a base player, a guitar player, and a ukulele player.  Having a live trio is much needed to get the full effect of the Hawaiian dream destination wedding.  Not only is hula a big part of our islands but other Polynesian dance forms taking place here.\n\nTahitian dance or what you may know more familiar as fast drums and beautiful girls shaking their hips very fast.  This is also a great treat to have at your reception it is much different from hula of course, not only is it a different culture but it is a different dance form.  So if you are looking to get the crowd up and shaking their hips Tahitian is the way to go!\n\nFire Knife dancers also can give a great show to liven up the mood and make your night very memorable.  Our fire knife dancers are trained to withhold two sticks lit on fire and twirl them in the air and even eat the flames.  There is so much that we could offer to make your day special and unforgettable.  Please check our website Hawai’i Hula Company for more information!\n\t  "},
{"title": "Hula Bachelorette Party", "content": "Dec 15\n\t  Hula Bachelorette Party\n\tNo Comments »\n\t  \n\t\tWhen one thinks of a destination wedding it most likely involves a tropical drink and a gorgeous sunset.  Hawaii is amongst one of the top destination wedding spots in the world.  So when your thinking of planning your special day you want to incorporate all that paradise has to offer.  And what better way to get your favorite girls, a flirty hula wrap, and a sassy hula lesson.\n\nHula Bachelorette parties are trending like no other, let Hawaii Hula Company take over and make your paradise dreams come to life.  A beautiful hula maiden will greet you and your party imagine dancing on a white sandy beach with your toes in the sand and your hair blowing in the cool salty air.  You will be infused with colorful and fragrant flowers and will even get to sew a beautiful crown befitted for the queen you truly are.\n\nOnce you are finished making your beautiful fresh flower adornments   you will learn the basic steps and be taught a traditional hula mele (song) and you are welcome to video tape and take as many pictures to make this a memory to last a lifetime.\n\nIn the Hawaiian language the word flower is referred to as “Pua” and “Pua” can come in all different colors shapes and fragrances.  Here we have plumeria and purple orchids.\n\nThe wraps or “pareos” that these lovely ladies are wearing are formally used in Tahitan dance but since we are polynesian cousins we as hula dancers have adopted these beautiful wraps and use them as practice skirts and even costumes.  We provide each lesson with pareos for each participating hula dancer.\n Aloha is a Hawaiian symbol.  Its meaning goes beyond any definition you can find.  In Hawaii you hear aloha, you feel aloha, and more importantly you are treated with aloha.  To learn more please visit Hawaii Hula Company\n\t  "},
{"title": "Heiva I Tahiti", "content": "Apr 30\n\t  Heiva I Tahiti\n\tNo Comments »\n\t  \n\t\tIn the Tahitian language, the word Heiva refers to activities, pastimes, physical exercise, and festivals. Additionally, music, dancing, singing and sporting events have always held an important place within the Polynesian communities. In ancient times, dance was one of the most sophisticated and ritualized art forms performed in both groups and individually.\nIn the 19th Century, Christian missionaries condemned these demonstrations that were described as an erotic form of debauchery. In the year 1819, King Pomare II legally forbade the practice. At that time, after being banished from public areas, dancing became a clandestine practice for the people. Traditional dance made resurgence in 1881 after being severely restricted for several decades. That year, the first Heiva I Tahiti was organized and named Tiurai, meaning “July the month of festivities.”\nMore than just a simple festival, Heiva I Tahiti has become the symbol of the Polynesian culture and an iconic event for a people proud of their heritage. These performances highlight the drama of an opera and the distinct imprints of an ancestral tradition. The dances are unique creations that are based on a historical or legendary theme.\nIf you are looking to learn more about the traditions of Tahiti, inquire about the services and performances offered by Hawai’i Hula Company. Or if you are looking for that thing to get your guest up and moving, our beautiful Tahitian dancers can do just that!\n\t  "},
{"title": "In honor of King Kalakaua", "content": "Apr 29\n\t  In honor of King Kalakaua\n\tNo Comments »\n\t  \n\t\tIt’s that time of year again, when the angelic voices of the oli and the elegant motions of the hula are demonstrated with transcendence at the annual Merrie Monarch Festival. The Merrie Monarch Festival is a weeklong celebration that takes place once a year in Hawai’i nei. The festival includes different “Halau” or dance groups from all over the islands as they compete for the title and trophy of the most skilled dancers. This event also honors the legacy left behind by the late King David Kalakaua, who inspired the perpetuation of our native language and arts. This festival also strives to perpetuate the Hawaiian traditions of long ago through activities, songs, and dance. Similarly, Hawai’i Hula Company aims to accomplish the same goal through the services that we offer. If you are looking to be active in these traditions, you can do so through our private hula lessons. If you are looking to relax, indulge in our Hula and Tahitian performances that we offer. All in the same, if you are looking for something to bring the “Aloha Spirit” and Hawaiian culture to your event, the dancers of Hawai’i Hula Company will do just that.\n\t  "},
{"title": "Pele a me ke kumula’au Ohi’a Lehua", "content": "Jul 28\n\t  Pele a me ke kumula’au Ohi’a Lehua\n\tNo Comments »\n\t  \n\t\tIn Hawaii nei there are many stories and legends of long ago that we still keep till this day. Many of these legends include our ancient volcano goddess Pele.\n\nOne day in the times of old the goddess Pele journeyed through the forest near the home of the handsome Ohi’a and spied the young man at work. Pele was smitten by him, and decided to engage with him in conversation. Ohi’a spoke politely and was warm towards the beautiful woman, but did not respond to her flirtation, which upset Pele greatly. She was determined to have this young man for herself, but before she could renew her efforts, Lehua came to the place her young husband was working to bring him his midday meal.\nWhen he saw his lovely wife, Ohi’a’s face lit up with love. He dropped everything at once and went to her side, leaving a fuming Pele to stare in jealous rage at the young couple. Dropping her human disguise, the goddess transformed into a raging column of fire and struck Ohi’a down, transforming him into a twisted ugly tree in revenge for spurning her advances.\nLehua fell to her knees beside the twisted tree that had once been her husband. Tears streaming down her lovely face, she begged Pele to turn him back into a man or else turn her into a tree, as she could not bear to be separated from her beloved. But Pele ignored the girl, taking herself up to the cool heights, her anger satisfied. But the gods saw what Pele had done to the innocent lovers and were angry. As Lehua lay weeping in despair, the gods reached down and transformed the girl into a beautiful red flower, which they placed upon the twisted Ohi’a tree, so that she and her beloved husband would never more be apart.\nFrom that day to this, the Ohi’a tree has blossomed with the beautiful red Lehua flowers. While the flowers remain on the tree, the weather remains sunny and fair. But when a flower is plucked from the tree, then heavy rain falls upon the land like tears, for Lehua still cannot bear to be separated from her beloved husband Ohi’a.\n\n\n\n\n\n\nThe hula is significant to these legends because it is one of the ways in which the Hawaiian people keep record of such tales. Hawaii Hula Company offers both entertainment and lessons so that you too can embrace the traditions of long ago. If you are looking for something to spice up your wedding, graduation party, birthday party or just your average barbeque, Hawaii Hula Company can do just that!\ninfo@hawaiihulacompany.com\n808-646-1455\nHawaiiHulaCompany.com\n\t  "},
{"title": "Hula in Hawaii", "content": "Jun 18\n\t  Hula in Hawaii\n\tNo Comments »\n\t  \n\t\tHawaiian proverbs and poetical sayings or commonly known as ‘Olelo No’eau are one of the many ways in which the Hawaiian people kept their culture, their history, and their stories. There are over two thousand Hawaiian proverbs that have been passed down from generation to generation. Some of my favorite proverbs are those that talk about the Hula, I hope you will not only enjoy them but learn from them as well. Although words cannot begin to describe Hula entirely, I believe these proverbs can brush the surface of the importance of Hula…\n\n \n\nHula Dancers\n\n“Hopoe, ka wahine lewa i ke kai”\nHopoe was a dancer of Kea’au, Puna, in that long ago day when gods mingled with men. Because of her dancing and her kindly nature, the goddess Hi’iakaikapoliopele as a favorite friend took Hopoe. When Pele sent Hi’iaka to Kaua’i to fetch Lohi’au, the first request Hi’iaka made to Pele was to be kind to her friend Hopoe. After a time, when Hi’iaka did not return as expected, Pele in a fit of rage destroyed Hi’iaka’s grove and the beloved Hopoe. The latter was changed into a balancing stone that seemed to dance in the sea.\n\n“I le’a ka hula i ka ho’opa’a”\nThe hula is pleasing because of the drummer.\nThe lesser details that one pays little attention to be just as important as the major ones. Although the attention is given to the dancer, the drummer and chanter play an important role in the dance.\n\n \n\n \n“Kuhi no ka lima, hele no ka maka”\nWhere the hands move, there let the eyes follow.\nA rule in hula.\nHula dancer at a backyard casual wedding\n“Mai pa’a i ka leo, he ‘ole ka hea mai”\nDo not withhold the voice and not call out [a welcome]\nFrom a password chant used in hula schools. One who would like a friendly invitation to come into another’s home often used it.\n\nHawai’i Hula Company not only portrays the traditions of the Hawaiian culture and the Hula but offer lessons as well. Inquire with Hawai’i Hula Company about our beautiful Hula dancers for your next party, wedding, or event. If you really want to get your event started right, ask about our private and group Hula lessons. This will surely have your guest engaged in the traditions of Hula and practices of long ago…\ninfo@hawaiihulacompany.com\n808-646-1455 for booking information\n\t  Hula DancersHula dancer at a backyard casual wedding"},
{"title": "Hawaiian `Ōlelo No`eau and Hula…", "content": "Jun 02\n\t  Hawaiian `Ōlelo No`eau and Hula…\n\t1 Comment »\n\t  \n\t\tHawaiian proverbs and poetical sayings or commonly known as ‘Olelo No’eau are one of the many ways in which the Hawaiian people kept their culture, their history, and their stories. There are over two thousand Hawaiian proverbs that have been passed down from generation to generation. Some of my favorite proverbs are those that talk about the Hula, I hope you will not only enjoy them but learn from them as well. Although words cannot begin to describe Hula entirely, I believe these proverbs can brush the surface of the importance of Hula…\n“Hopoe, ka wahine lewa i ke kai”\nHopoe was a dancer of Kea’au, Puna, in that long ago day when gods mingled with men. Because of her dancing and her kindly nature, the goddess Hi’iakaikapoliopele as a favorite friend took Hopoe. When Pele sent Hi’iaka to Kaua’i to fetch Lohi’au, the first request Hi’iaka made to Pele was to be kind to her friend Hopoe. After a time, when Hi’iaka did not return as expected, Pele in a fit of rage destroyed Hi’iaka’s grove and the beloved Hopoe. The latter was changed into a balancing stone that seemed to dance in the sea.\nHula Dancer\n“I le’a ka hula i ka ho’opa’a”\nThe hula is pleasing because of the drummer.\nThe lesser details that one pays little attention to be just as important as the major ones. Although the attention is given to the dancer, the drummer and chanter play an important role in the dance.\n\nThe live polynesian drums call attention to the ceremony area, let guest know we are about to start\n“Kuhi no ka lima, hele no ka maka”\nWhere the hands move, there let the eyes follow.\nA rule in hula.\n\n\n“Mai pa’a i ka leo, he ‘ole ka hea mai”\nDo not withhold the voice and not call out [a welcome]\nFrom a password chant used in hula schools. One who would like a friendly invitation to come into another’s home often used it.\n\n \nHire Hula dancers\nHawai’i Hula Company not only portrays the traditions of the Hawaiian culture and the Hula but offer lessons as well. Inquire with Hawai’i Hula Company about our beautiful Hula dancers for your next party, wedding, or event. If you really want to get your event started right, ask about our private and group Hula lessons. This will surely have your guest engaged in the traditions of Hula and practices of long ago…\nCall us today at 808-646-1455 to make a reservation for Hula dancers, Tahitian dancers, Musicians and Fire knife dancers.\nWe also offer private one on one and private group Hula lessons and Lei making workshops.\nwww.hawaiihulacompany.com\ninfo@hawaiihulacompany.com\n808-646-1455\nHula Dancers\n\t  Hula DancerThe live polynesian drums call attention to the ceremony area, let guest know we are about to startHire Hula dancersHula Dancers"},
{"title": "Tahitian Entertainment by Hawai`i Hula Company", "content": "May 13\n\t  Tahitian Entertainment by Hawai`i Hula Company\n\tNo Comments »\n\t  \n\t\tIa Orana from Tahiti and haere mai!\nHello and come near! Join us as we take you on a journey through the beautiful islands of Tahiti. There are many attractions that come from the islands of Tahiti, the sweet fragrance of the Tiare flower, the fast drumbeats of the To’ere drum, lastly the beautiful vahine and strong tane. Tahiti covers more than two million square miles of the South Pacific Ocean and is comprised of islands and atolls spread over five great archipelagos.\nTahitian Dancers on the lawn of the Ritz Kapalua, Maui\nTahitian dancers in Wailea, Maui \nTahitian dancers for your next Event? \nHire Tahitian Dancers\nNow although similar to the Hawaiian Hula, the Tahitian dance is unique in many different ways. For the men of Tahiti, the focus of their dance comes from the rapid shaking of their knees and legs. As for the women of Tahiti, most of the focus is on the movement of their hips. The hip movements will sometimes move very smooth and slow and sometimes very fast. There are generally two types of Tahitian dances, Ote’a, which includes very rapid drumbeats and hip movements, and the Aparima, which normally includes very smooth and very slow hip movements. Tamure or formally known as ‘Upa’upa is a co-ed type of dance with both male and female dancers. Like in any Polynesian dance we have our basics, in Tahitian we have…\nFa’arapu– Moving the hips in a circular motion as fast as you can\nTamau– Shifting of the hips from left to right\nAfata– Taking the hips and moving them in a square like motion\nVaru– Smoothly moving the hips in a figure eight motion\nOpe– Moving the hips in continuous half circle\nTahapehape– Doing Fa’arapu while shifting your hips from left to right keeping a 45 degree angle\nHire Tahitian dancers\nTahitian show from drummers area\nHire Tahitian Entertainers for your event-click here\nThere are many more basic hip movements that do no justice in words. Hawai’i Hula Company offers a variety of services such as Tahitian drummers, Tahitian dance performances, and even Tahitian dance lessons. Our audience participation is one the most exciting parts of our show. This is when our dancers randomly pull up people from the audience and have them compete in a friendly Tahitian competition against one another. Whoever brings the best moves and the fastest shake to the table is crowned the winner. This is the perfect type of entertainment if your looking to spice up and shake up your event. Whether it’s a wedding, a party, or just friends getting together it will surely have your guest breaking a sweat and it will beyond a doubt be an experience to remember.\nPlease contact us for Tahitian Entertainment at your next event.\nwww.hawaiihulacompany.com\n808-646-1455\ninfo@hawaiihulacompany.com\n \nAll photos are the property of Hawaii Hula Company LLC. No unauthorized usage of these photos allowed.\n \n\t  Tahitian Dancers on the lawn of the Ritz Kapalua, MauiTahitian dancers in Wailea, Maui Tahitian dancers for your next Event? Hire Tahitian DancersHire Tahitian dancersTahitian show from drummers areaHire Tahitian Entertainers for your event-click here"},
{"title": "Hire a Hula dancers for Hawaii wedding entertainment", "content": "Jan 23\n\t  Hire a Hula dancers for Hawaii wedding entertainment\n\tNo Comments »\n\t  \n\t\tA destination wedding in Hawaii? Sign me up please! A lot of engaged couples are flocking to Hawai’i to get married, looking to tie the knot somewhere tropical. Get hitched barefoot on the beach with their toes in the sand.\nHire Hula Dancer\nTahitian dancer on the beach\nOr perhaps for the more refined couple, at a sprawling estate in the mountains with that spectacular ocean view.\nHula dancers at a oceanfront wedding\nWedding Hula Dancers\nWhich ever venue you fancy, there is that question of what other fun Hawaiian options there are to offer a couple looking to make their day especially memorable. A Hula dancer of course!Having some Hawaiian music in the background while you feel the trade winds in your hair sets an amazingly peaceful and tranquil vibe.\nTrio of Hawaiian Musicians with 2 Hula dancers performing\nThe guitar and the ukulele blending so well, accompany the Hula dancer as she tells a story of love. Using delicate and graceful motions, she glides through each verse, her smile delighting you and your guests with a genuine aloha in spirit.\nHula dancer at a backyard casual wedding\nFor a larger wedding, it is nice to entertain your guests with variety in the show. Having Hula and Tahitian brings hiring Hula dancers to a whole new level. A little of Hawai’i and a little of Tahiti? What could be better for a Hawaii Wedding?\nTahitian show from drummers area\nTahitian dancers pose with guests and clients for photos\nHaving a show that includes several dancers allows costume changes and multiple looks and styles of dancing in one show. Our most popular show includes 3-4 Hula Dancers and 2-3 musicians playing Hawaiian music followed by the spectacular Fire knife finale!\n3 Fire knife dancers finale\n\nBlazing Fire in the night sky, these talented men will have the crowd in awe in seconds! Hawaii Hula Company is made up of hundreds of years of experienced professional Hula dancers, Tahitian dancers, Hawaiian Musicians and Fire knife dancers. The first step to booking is to head on over to our website and seeing what we offer. Our Facebook page is very popular and holds a wealth of information for any couple looking to get married in Hawaii. We also have a Youtube channel for our brides and grooms to watch some videos of some of our past performances. Hawaiian Wedding Entertainment is a beautiful addition to any wedding in Hawaii.\n\t  Hire Hula DancerTahitian dancer on the beachHula dancers at a oceanfront weddingWedding Hula DancersTrio of Hawaiian Musicians with 2 Hula dancers performingHula dancer at a backyard casual weddingTahitian show from drummers areaTahitian dancers pose with guests and clients for photos3 Fire knife dancers finale"},
{"title": "Hawaiian Weddings on Maui and O`ahu", "content": "Nov 18\n\t  Hawaiian Weddings on Maui and O`ahu\n\t1 Comment »\n\t  \n\t\tWe are all about LOVE here at Hawai`i Hula Company and we consider ourselves blessed to be sought out by many local Hawaii residents as well as many destination brides and grooms. Year after year, we are fortunate to be a part of their special Maui wedding day or O`ahu Wedding day.  As the year pulls to a close, we wanted to feature some of our favorite wedding moments from some of our Maui Weddings and O`ahu Weddings in the past year.\nBeing a part of any wedding is an honor, we are pleased to be able to share our Hawaiian Culture with people from all over the world. Bringing Hula and Tahitian shows to such a festive occasion is always fun.\nHawaiian Music brings such a peaceful and island vibe to any occasion, but at a wedding, it is a must! Fire knife dancers top it all off. The grace and strength is just something everyone must see. If not once in their lives, many times over!\n \nHula Dancers\n \nKane Tahitian Dancer with small guest\nBride and Groom with Hawaiian musician\nAudience Participation: Bridal Hula Lesson\nHula dancers with Hawaiian Musician\nFire knife dancers ready to perform\nTahitian Dancers ready for the show\nFire knife dancer with wedding guests\nPolynesian Wedding entertainers with bride and groom:\nTahitian dancers with Fire dancer\nBackyard barbecue style wedding reception with 2 Hula dancers\nHula dancers with Fire knife dancer and Drummer\nWedding Hula Dancers\nWedding party and guests with Hula dancer and Fire knife dancer\nWedding party with Bride, Hula dancer and Drummer\nWedding hula dancers with Fire knife dancer and live polynesian drummer\nMahalo to all of our wonderful Bride and Groom Clients for making what we love to do a part of their celebration of LOVE!\nFrom all your friends at Hawaii Hula Company\n808-646-1455\nwww.hawaiihulacompany.com\n\t  Hula DancersKane Tahitian Dancer with small guestBride and Groom with Hawaiian musicianAudience Participation: Bridal Hula LessonHula dancers with Hawaiian MusicianFire knife dancers ready to performTahitian Dancers ready for the showFire knife dancer with wedding guestsPolynesian Wedding entertainers with bride and groom:Tahitian dancers with Fire dancerBackyard barbecue style wedding reception with 2 Hula dancersHula dancers with Fire knife dancer and DrummerWedding Hula DancersWedding party and guests with Hula dancer and Fire knife dancerWedding party with Bride, Hula dancer and DrummerWedding hula dancers with Fire knife dancer and live polynesian drummer"},
{"title": "A Letter from the Director…", "content": "Jun 21\n\t  A Letter from the Director…\n\t1 Comment »\n\t  \n\t\tGratitude.\nSo amazing to grow up in a life that does consist of going to the beach on a weekly basis at minimum. Fetching mangoes from the neighbors yard and hearing stories of long ago from our kupuna. What storytellers our people are! After all, these stories carry our history and our imprint on this earth as a people collectively. I started dancing Hula as soon as I could stand and move simultaneously. It was a very natural thing, for there is music everywhere! In the leaves of the trees as the wind blows by. In the crashing of the waves on the sand, the repetition is effortless. It was a love affair from the beginning for me. Hula had me at ‘Ami.\nI am so grateful for and wish to thank all our talent and our supportive clients for allowing Hawai’i Hula Company to carry the torch, from one generation to the next, from one person to the next and so on… I am so blessed and grateful to be able to work with such bright and dedicated individuals on a regular basis.  I sit back and reflect at how lucky I am to not only be able to work with the people of Hawai’i Hula Company but to learn from them as well, all the time. I stand in awe of their talent, dedication and kuleana (responsibility).\nHula dancers being true ambassadors of Hawai’i, disciplined to embody the spirit of Hawai’i, bring mele (song) to life inspiring those who are lucky enough to be there to watch.\nTahitian dancers who take your breathe away, leaving you amazed at the level of skill required and how well Tahiti is represented here in Hawai’i.\nHawaiian Musicians who are so skilled in their craft,  and the art of entertainment, they are the heart of the atmosphere and bring the occasion to life.\nFire Knife dancers illuminating the sky with fire and passion, sharing the traditions of Samoa with the utmost respect, here in Hawai’i.\nI make it a point to watch the faces of the audience members as often as I can. So endearing to see the faces of people from all walks of life, all ages, all continents and countries delight in awe for what we are so grateful to have had ourselves and therefore be able to share as Kanaka Maoli (Native Hawaiians)…\nA few of my favorite photos…\nHawai’i Hula Company dancer\n \nClick here to hire Hawaiian entertainment\n \n \nHire Hawaii Hula Company Hula dancers\n \nExpedia Commercial Tahitian dancers\nPrivate Group Hula Lessons(click here)\nHula dancers at a birthday party\nGiving Mayor Caldwell a Hula Lesson\n2 Hula dancers and 3 Hawaiian Musicians\nTahitian dancers\nHula Dancers for events\n \nMahalo Nui Loa me ke aloha Pumehana…\nMahana Walters\nDirector\n(808) 646-1455\nwww.HawaiiHulaCompany.com\n \n\t  Hawai’i Hula Company dancerClick here to hire Hawaiian entertainmentHire Hawaii Hula Company Hula dancersExpedia Commercial Tahitian dancersPrivate Group Hula Lessons(click here)Hula dancers at a birthday partyGiving Mayor Caldwell a Hula Lesson2 Hula dancers and 3 Hawaiian MusiciansTahitian dancersHula Dancers for events"},
{"title": "A Story of Hawaiian Music. The beginning of Slack Key Guitar.", "content": "May 23\n\t  A Story of Hawaiian Music. The beginning of Slack Key Guitar.\n\tNo Comments »\n\t  \n\t\tHire Hawaiian Musicians\n \nA Story of Hawaiian Music. The beginning of Slack Key Guitar.\nby Owana Salazar\n \nHawaiian Slack Key is a style of playing the guitar that utilizes open tunings or variations of tunings. An excellent player can also achieve the unique slack key sound in standard tuning.  It is a distinctive sound, characteristic to modern Hawaiian music, that finds its roots in the days of the Hawaiian Cowboy or Paniolo and, yes, the Hawaiian Cowgirl or Paniola.\nThe fascinating story is shared, that King Kamehameha the Great received a gift of a small number of cattle from the explorer and friend, Captain Vancouver.  Because the cattle were so rare, the king created a law that they were to roam free and remain unharmed.  As everything in Hawaii flourishes so well, the cattle multiplied and multiplied and it eventually became necessary to control the huge resulting population.  By that time Kamehameha the Great had passed on and Hawaii was governed by his son, Kauikeaouli, known as King Kamehameha III.  The good king sent for the Vaqueros to come to Hawaii in order to teach the Hawaiian men everything there was to know about cattle and ranching.\n\nI can just imagine what it might have been like in those days… Way up, on the slopes of Mauna Kea and the plains of Waimea, or in the lighter forested areas of Panaewa and Opihikao.  By day, building fences, driving the cattle into herds, daily committing themselves, to do everything it took to bring order to the chaos of those wild animals.  Hard work is deserving of rewards.  At night, they made fires to cook their food and gathered around them to keep warm.  While gathered around the warming campfires, the Vaqueros would bring out their guitars and play their music.  What a wonder it must have been to have first experienced what beauty could come out of a wooden box!  A sound never heard before and sweet melodies to calm the wild cattle.\nHire Hawaiian Musicians\nMusic is a universal language and with all that working together everyone had to find a way to communicate with one another.  I suppose there were some who enthusiastically learned each language enough to translate.  But I also believe that their music and guitar playing was also a very meaningful factor in that learning and sharing.\nHawaiian Musicians\nSpanish music uses open tunings and the most common is known as Open G.  It caught on fast and just as Hawaiians quickly learned to drive and herd cattle, they also learned to play the guitar and soon they creatively applied their own songs to the accompaniment.  The fundamental Open G tuning was affectionately re-named Taro Patch, no doubt because the taro is the root of the Hawaiian people.\n\nIt is from these historical events, marking the blending of unique cultures, that Hawaiian Slack Key or Kīhoʻalu (loosening the keys) was born.\n \n\nTo hire Hawaiian Musicians for your next event, Please take a look at our website:\nwww.HawaiiHulaCompany.com\nhttp://www.hawaiihulacompany.com/musicians.html\nFacebook:\nhttp://www.facebook.com/pages/Hawaii-Hula-Company/101273199967035?ref=hl#\nYou Tube:\nhttp://www.youtube.com/user/HawaiiHulaCompany/videos\n\n \n\t  Hire Hawaiian MusiciansHire Hawaiian MusiciansHawaiian Musicians"},
{"title": "Hawaii Hula Company brings Joy to an Ohana gathering", "content": "Apr 29\n\t  Hawaii Hula Company brings Joy to an Ohana gathering\n\tNo Comments »\n\t  \n\t\t \nHula Kahiko with Kane and Wahine Hula Dancers\n \nWe love to hear from our clients and do our best to post their kind words on our website here: \nHawaii Hula Company\nWhen we do receive special requests we do our best to make each event special. This letter comes from a client and we would like to share it with you…This local Aunty was so sweet and really treasured Hula. She requested a Kahiko performance with Hula dancers and Hawaiian oli (chant) and mele (song).\nAloha Mahana,\n I just want to share with you what a wonderful production Kumu Ku and the dancers did. They were such great dancers with personality and so uniform. They did a beautiful job with the Kahiko and Ku took us on a story to each of the islands, which gave everyone a feel for our beloved Hawai`i.\nMahalo Nui Loa for the gift of the Kahiko dancers and also the Awana and the beautiful falsetto. It brought tears for many of us………..\nPeople from the park came and we had the honor of a wedding bride and groom join us, too. From ancient times to present and going into the future.\nA gift that will be forever a part of my international families life and stories shared.\n as I get pictures and film I will forward it to you.\nThis was the first time in 18 months I have been outside for this amount of time. I had broken my back and surgeries with rehab. What a wonderful gift you shared with us. It was indeed an honor.\nWith your permission I would like to put a picture up on my facebook page Kealohalei Makamae to recommend your services and also with my linked in page.\nAll of our guests felt the Mana and allof the Ancestors came to celebrate and bless the land that opened its arms to us in Waimanalo. A Perfect day.\nMahalo Nui Loa for your consideration and coordination. It reaches down to our souls to share the Aloha\n \nMalama Pono\n Lynn Kealohaleimakamae Eklund\nOur response at Hawai’i Hula Company: \nAbsolutely, you may share this with whom ever you would like. We were happy to provide this for you and appreciate your beautiful letter.\n\n\nMahalo Nui Loa,\n\n\nHire Hawaiian Musicians for any event on Maui & O’ahu\nHula Dancers perform Hula Kahiko to oli (chant)\nKane Hula Dancer at Waimanalo beach\nHula Dancers for any event on Maui & O’ahu\nAnother Happy Client\nCall us here for your next gathering or celebration\n\t  Hula Kahiko with Kane and Wahine Hula Dancers\n\nMahalo Nui Loa,\n\n\nMahalo Nui Loa,\nMahalo Nui Loa,Hire Hawaiian Musicians for any event on Maui & O’ahuHula Dancers perform Hula Kahiko to oli (chant)Kane Hula Dancer at Waimanalo beachHula Dancers for any event on Maui & O’ahuAnother Happy ClientCall us here for your next gathering or celebration"},
{"title": "Expedia chooses Hawai’i Hula Company for new commercial", "content": "Feb 20\n\t  Expedia chooses Hawai’i Hula Company for new commercial\n\t4 Comments »\n\t  \n\t\t\n\nPrivate Group Hula Lessons\n(click here)\n\n \nSo it was a typical day at Hawaii Hula Company, coming back to the office from a Private Group Hula lesson, we got a call.  Not Just any call…\nNow we have had plenty of calls from “big names” in the television and film industry. We have learned that most of these “producers” are really just trying to sell us on how great it would be to “experience” shooting with them…a lot of times, for free…or very little pay. We are all about sharing Hula with the world and helping to perpetuate our culture. We must also know how to protect it and our people who are helping to preserve our traditions. Hula dancers need to eat too! Lol…we work up quite an appetite!\nSo, it was an Expedia Producer on the phone…I listened, I have to admit, skeptically in the beginning. He was very unfamiliar with Hawaiian and Tahitian dance and culture, but very receptive to learning which was refreshing. We had a nice conversation about keeping authenticity in the  cultural performance and protocols. Expedia wanted our help to create a show where the audience member would be brought up to share in the performance with our Tahitian dancers. It was to be all about the moment where a visitor is brought into a new experience and the joy that brings to someone willing to try something new.\nWe worked out the details and arrived on a very windy afternoon in Wailea. Boy, it was cold!! Our dancers, who are always professional and ever ready to share, were troopers.  Bearing their costumes like the koa (Warriors) of the Aloha Spirit they are, they dressed in a Fisherman’s wrap and Ti leaf arm and leg bands and headed to the shooting area.\n\nOur Kane dancers\n\nThe crew was ready to shoot, and our Kane (male) Tahitian Dancers wowed the crowd with an amazing performance…The audience members really got into it! One of the audience members that got pulled up into the performance took his shirt off and really gave it a go, learning quickly with our dancers!!  It was getting wild and winder!\nThe crowd loved our performances and our dancers all did such a phenomenal job at repeating a very difficult routine over and over again to get all the right shots to make the Expedia commercial a huge success! It was an amazing experience and we were all so thrilled to be a part of it. Please look out for our Hawaii Hula Company performance on an Expedia commercial to be airing near you! Please take a moment to comment on this blog, it would mean the world to us. Mahalo!!!\n \n\n\n\t  "},
{"title": "Reflections on Hula from Hula dancers", "content": "Jan 06\n\t  Reflections on Hula from Hula dancers\n\t3 Comments »\n\t  \n\t\tHau’oli Makahiki Hou from Hawai’i Hula Company!!!\n2013. Well, it is a brand New Year. Full of possibility, loaded with opportunity, singing with promise. We are all happy from the holidays and have plenty on the horizon for the new year. Here at Hawaii Hula Company, we too have many new things in the works!!!\nSometimes its good to take a step back and reflect before marching ahead. Before moving forward into a new year and all the possibilities that comes with it, let us reflect. Reflect on what it means to us as Hula dancers to practice and perpetuate our culture through Hula accompanied by mele (song) or (oli).\nWe have asked a few of our gracious dancers to share their reflections on being a Hula dancer…\nKehau, Hula Dancer\n \nHula is an art of dancing which represents culture and traditions of the Hawaiian islands. From the graceful hands, swaying hips and foot movements, people around the world have come to appreciate and admire the stories told by Hula dancing. As a Hula dancer for so many years it has become a form of dedication, sacrifice and unconditional emotions. My deliverance of hula is very sincere to my audience, friends, family, teachers and most importantly….Ancestry. I call it an untouchable gift. During any hula songs/dancing my focus is on the connection within my self to portray the meaning. Receiving a smile or tears of joy is a reward for what I love to do. I will continue to share the Aloha spirit and represent the art of Hula for as long as time permits.\nKehau, Hula Dancer\n \n \n \nMahana, Hula Dance\nI started dancing as soon as I could…about age 4. Growing up in a house of Hawaiian language and Hawaiian music, I actually felt like I had invented this dance because it seemed to come from deep within myself. I was lucky enough to be the youngest haumana (student) in my first Hālau (Hula school), studying under Ray Fonseca in Volcano. I was a little intimidated at first but was so eager to learn and be like the older girls in the hālau, who, in a  short time became young women I very much looked up to.  Growing up dancing Hula has been a way of life for me. It taught me discipline, has taught me about our Hawaiian culture and allowed me to experience things I never dreamed…Touring Aisa dancing Hula and traveling through out Taiwan and Korea, being exposed to those cultures and its people…Dancing Hula solo on the Waikiki Shell stage to a crowd of thousands at the World Invitational Hula Festival…And my personal favorite part of being a Hula dancer, just being able to jump up and dance a song at the drop of a hat at some laid back lū’au or gathering. Hula has been and will remain one of my deepest and treasured blessings.\nMahana, Hula Dancer\n \nKawela, Hula Dancer\nWhen I first started dancing it was because my mom said so, she thought it would be good for me. So I went. That is how it was in my house. LoL. I was pretty uninterested until one day when it clicked, I was creating a visual equivalent to the sounds and music. Course, it didnt sound so eloquently put–it was the inner thoughts of a 3rd grader.  Once I realized that I was telling the story of the song, it was a sense of responsibility that followed. The fact that I was in charge of “painting a picture” for the story in the music, was more than I had ever been given to take care of.  It was my kuleana (responsibility/duty) and I was up for the job! Ever since then, Hula has been a part of my life. I take it with me where ever I go, I treasure the joy I can actually bring to others. It will always be something I carry in my heart, to share my heart through each and every time I perform.\nKawela, Hula Dancer\n \nWe hope you have enjoyed hearing from some of our dancers. We welcome you to comment at the bottom. Please consider us for your next event on Maui or O’ahu. Hawaii Hula Company, expect only the best.\nHawaii Hula Company, Authentic and professional Hawaiian Entertainment.\n\t  Hau’oli Makahiki Hou from Hawai’i Hula Company!!!Kehau, Hula DancerMahana, Hula DanceKawela, Hula Dancer"},
{"title": "A destination wedding on Maui featuring Hawaii Hula Company", "content": "Dec 02\n\t  A destination wedding on Maui featuring Hawaii Hula Company\n\t4 Comments »\n\t  \n\t\tWe have a lot of bookings and are not able to take the time we would like to share about all our events, but once and a while, we like to highlight an event on our blog. We put this one together last minute but it worked out beautifully.\nAbout a week ago we got a call from Steve’s assistant. He was due to be here for his wedding in a week and the entertainment was not in place yet! Oh No!! The Grand Wailea requires event insurance for all the performers so that complicates things for their clients.\nLuckily, Hawaii Hula Company offers insurance for all our events! We were able to put together a Hawaiian Trio (3 musician band consisting of Ukulele, Guitar and bass) for 3 hours, 4 Hula dancers (featuring both kane “male” & wahine “female” dancers), 2 Fire dancers with live polynesian drums. A great Hawaiian Entertainment line up for any destination wedding!\nThe evening started of with the Live drums marking the start of the beautiful oceanfront ceremony.\nThe live polynesian drums call attention to the ceremony area, let guest know we are about to start\nThe bride was beautiful and the groom in wonderful spirits for photos while our musicians treated guests to Traditional Hawaiian music mixed with Modern Island style music. The lively and aloha-envolking music moving through the air was accompanied by a lovely soft breeze… The guests mingled and laughed enjoying the atmosphere and great food. The Maui Sunset was spectacular as always…\nTraditional Hawaiian music mixed in with Modern island style music\nA close up of those Ukulele hands…\n \n \n \n \n \n \n \n \n \n \n \nNext up, our Hawaiian trio welcomes the Hawaii Hula Company Hula dancers to perform Hula for the happy guests. The atmosphere was soon full of sound and visual excitement as our Hula dancers swished and turned about that stage! So lively and full of energy, it brought silence and smiles to the crowd as they watched with glee.\nOur Hawaii Hula Company dancers can be hired by clicking here\nAfter the Hula dancers gave us a finale to remember, it was time to call on volunteers!!! AUDIENCE PARTICIPATION TIME!!\nThis is a great option to engage your guests and something for everyone of and age or skill can enjoy! We call on volunteers to learn a little hula with us. It is always a crowd pleaser and sometimes hilarious for the audience watching participants.  As a side note, Hawaii Hula Company is happy to offer private Hula lessons outside of weddings as well, click here to see more: Book Hula Lesson.\nHula lesson for the audience\nHula lesson for the kane too!\n \n \n \n \n \n \n \n \n \nFinally, after all the good food, entertainment and great Hula fun, it was time for the finale…FIRE KNIFE DANCERS.\nGuests were so excited as 2 of our Fire Knife Dancers twirled and threw fire knives all around and up side down. They were catching Fire knives from each other, twirling the Fire Knives up in the air and then catching them! Throwing the fire knife around their body dancing to the beat of the live polynesian drums.  What a way to end the evening! What an evening full of beautiful entertainment!\nHawaii Hula Company Fire Dancer\nWe wish Steve and Samantha a lifetime of happiness and love. We were so happy to be able to share our Culture and talented performers with you on your special day.\nTo hire your own Hula Dancers, Hawaiian Musicians, Fire knife Dancers or  Polynesian drummers visit our website at http://www.hawaiihulacompany.com\nPlease feel free to call us and we will be happy to talk more about your event and what we can offer you and your guests.\nWhether it is a desitnation wedding or a small beach ceremony, a 1st babies birthday party or an 80th birthday party, we tailor each and every event to your needs and requests. We can help to bring the Hawaiian talent that will elevate the experience of your event. Contact us today!\nMahalo Nui for stopping by to read our blog. We are always happy to share our mana’o with everyone. We wish you a beautiful day and hope to hear from you soon!\n\t  The live polynesian drums call attention to the ceremony area, let guest know we are about to startTraditional Hawaiian music mixed in with Modern island style musicA close up of those Ukulele hands…Our Hawaii Hula Company dancers can be hired by clicking hereHula lesson for the audienceHula lesson for the kane too!Hawaii Hula Company Fire Dancer"},
{"title": "Hire Hula Dancers in Hawaii", "content": "Nov 12\n\t  Hire Hula Dancers in Hawaii\n\t1 Comment »\n\t  \n\t\t‘A’a i ka hula, waiho ka hilahila i ka hale. \nWhen one wants to dance the hula, bashfulness should be left at home. \nHawaii Hula Company’s dancers admiring Diamond head\nHawaii is such an awe-striking and fascinating place. To visit here is to fall in love. To call Hawaii home is to live in love.\nWhat an honor it is truly, to live here in Hawaii. To feel the breathe of the sun kiss your cheek in the morning through the window seal, to have the gentle breeze in the evening to caress your shoulders as you take a stroll under the moonlight.  To take the day off and take off to Hana for some exploration and adventure, To be able to just take a walk and see natural beauty some wait their whole lives to witness in person.  To know Hawaii is to love her. It is out of this deep love and devotion that Hula was born. It is for these intangible reasons a child becomes a student of Hawaii…and then, and only then…a Hula Dancer.\nHawaii Hula Company dancer\n \n \n“It takes much dedication and diligence to Learn Hula and become a Hula Dancer.   I recall as a child practicing for hours to show my mother what I had learned in class but by the time she had gotten home, I was so burnt out I kept getting all the motions wrong. I knew it, but had just over done it to the maximum degree, my body just said no and my mind couldn’t convince it to change its mind…”\n  –Kona, Hawaii Hula Company dancer\n \n \nHawaii Hula Company dancer\nThe role Hula plays in your life as a Hula dancer is hard to explain. It becomes an expression that is as important as speaking in a way. Not to say it replaces any expression, but it does add on to your primary communication habits. When you raise your hand to your mouth to gesture someone or your self was speaking or gesture to the mountains using your hands as you tell a story, you know Hula has begun to become a part of you. It is a process of learning. To learn about Hawaii and Hawaiian culture and Hawaiian language is to learn about Hula and become a better dancer. To be able to interpret the song or chant properly is to know Hawaiian language or at least have a strong grasp on it. To tell stories of Hawaii, you have to know Hawaii inside and out. Love the different aspects of each island. Know that the west side is always a little drier, the East side always a bit more lush…know that the North shore experiences its surf worthy swells in the winter and the South side are the lucky surfers of the summer. You have to feel the pulse of Hawaii and its past. You have to feel the past of Hawaii’s people.\n –Moana, Hawaii Hula Company dancer\n \nHawaii Hula Company:Hula DancersTahitian DancersFire Knife DancersHawaiian Musicians\nOur Hula  dancers are born and raised in Hawai’i, Halau taught and are regulars at Merrie Monarch. \nOur Hawaiian Musicians include several Grammy award winners and Nā Hoku Hanohano award winners. \nOur Fire dancers come from generations of Fire Knife dancers and have been trained traditionally. \nWe are commited to perpetuating the Hawaiian culture and Hawaii’s people  through Hawaiian and ploynesian art forms such as: Hula Dancers, Tahitian Dancers, Hawaiian Musicians and Fire Knife Dancers. If you have an event coming up on Maui or Oahu, please call us for more information on how to hire a Hula dancer or booking our talent at 808.646.1455.  \nWe also encourage those who would like to learn more about Hula to contact us. Hawaii Hula Company brings a truly unique experience to those who wish to enrich their lives with HULA.  We offer Private Hula Lessons for those who want to learn more about Hula.\n\nMahalo and A Hui Hou…\n\t  Hawaii Hula Company’s dancers admiring Diamond headHawaii Hula Company dancerHawaii Hula Company dancerHawaii Hula Company:Hula DancersTahitian DancersFire Knife DancersHawaiian MusiciansMahalo and A Hui Hou…"},
{"title": "Hana, Maui…The heart of old Hawai`i", "content": "Nov 03\n\t  Hana, Maui…The heart of old Hawai`i\n\t2 Comments »\n\t  \n\t\tKa`ahumanu, wife of Kamehameha I is from Hana, Maui.\nHe nani `o Hana i ka`u `ike, `Âina `olu`olu uluwehiwehi \nBeautiful is Hana in my sight, Land cool and lush\n`Âina piha `oe i ke aloha,  A he wahi poina `ole `ia na`u \nYou are a land filled with love, A place I`ll never forget\nKe ku mau no a Ka`uiki,  A he pu`u kaulana no ka `âina \nThere stands Ka`uiki, A famous hill of the land \nHe aloha Ka`uiki a e ku nei, Ke one hanau o Ka`ahumanu \nBeloved is Ka`uiki that stands there, The birthplace of Ka`ahumanu\nHa`ina ka inoa a i lohe `ia`O Ka`ahumanu no e o mai\n Tell the name and let it be heard O Ka`ahumanu, do answer\nSongwriter credit: Alice Ku`uleialohapoina`ole Nâmakelua – She was inspired to write this song in 1973\nHANA, Maui’s dream-like paradise\nThe heart of old Hawai’i Nei…\nHana’s popularity has grown over the years, so much so that there are now not only numerous songs about the magical place, but cd’s that help guide you along your way. Today, there are many Hula which honor Hana.\nHula dancers on Maui and Hula dancers all over Hawai`i use Hula to interpret Hana’s lush land, peaceful tone and mana (powerful energy) that captivates Hana’s many admirers.  Songs that musicians sing tell of the waterfalls and serene beaches of Hana…Hula dancers through mele (song) tell of Hana’s magical ability to cast a spell of love on two people…Hula dancers on Maui and Hawaiian musicians on Maui in particular are responsible for guarding these stories and poems young and old for future generations.\nPeople from all over the world flock there daily to pay tribute, take photos and explore. We, at Hawaii Hula Company wish to share some great photos and insight on Hana to the world and all her future admirers. We also want to set some ground rules for your visit.\n\nNever litter, there are trash cans, use them. If you cant find one, take it to the car with you and toss it later.\nDo not trespass. Hana is a gift from God to the world but it doesn’t mean stomping through someone else’s backyard to get to a photo opp.\nDon’t drive like a maniac. The road winds and turns a lot and needs to be approached with caution and courtesy.\nPay respect to the place, in your own way, give gratitude for just having the privilege to be there and experience such a sacred place.\n\n\n\n\n\n\t  Ka`ahumanu, wife of Kamehameha I is from Hana, Maui."},
{"title": "Hire Hula dancers for a surprise wedding proposal in Hawaii", "content": "Oct 27\n\t  Hire Hula dancers for a surprise wedding proposal in Hawaii\n\t2 Comments »\n\t  \n\t\tA Special Hawaiian Engagement proposal\nOur Hula Dancers, ready to perform.\nCraig called us with an unusual request…He needed a special surprise proposal and wanted Hawaii Hula Company to be a part of it. His girlfriend, Melissa was a dancer and had a love of Hula and he wanted to incorporate that into his surprise.  He is not a dancer of any sort, he warned us, but wanted to have a Hula lesson prior to the master-minded proposal so he could surprise his girlfriend with some new moves. We plotted and planned and here’s what we came up with.\nSurprise Hawaiian Wedding proposal: THE PLAN\nFirst, We would hold a private Hula Lesson to teach Craig 1-2 verses of a song we would perform. The plan, to call him up as a participating audience member only to have him join in perfectly for the last verses.  Next we planned the proposal. Craig and Melissa would be casually strolling Kalākaua Avenue sight-seeing and enjoying the shopping in Waikiki. They would happen to come across a street performance where 3 Hula dancers were performing.  Once we spotted Craig in the crowd we would call him up at the right time. The crowd and his girlfriend would think he was just that poor guy who was called up and will most likely embarrass himself to the amusement of all watching. He would then propose to Melissa as the crowd and our Hula dancers watched and waited for the all-important answer…\nThe crowds builds…\n \nThe day of the Hawaiian Wedding proposal\nThe day came, planning and preparation were finished. Now time for the big reveal. We started an impromptu show at a perfect little area near the famous Duke Kahanamoku statue in Waikiki. The crowds came quickly and soon it was a frenzy…\nSure enough Craig and Melissa strolled up. They were enjoying the show as were a large group of visitors and locals who heard the music and upon the sight of Hula dancers, rushed over to get a glimpse of the Hawaiian Hula Show. We called for a volunteer from the audience…Melissa was shocked as Craig bravely volunteered with the crowd of hopefuls. We “chose” Craig as our audience participant. We started the song and Melissa’s jaw dropped! How did her honey know all the Hula motions? How could he dance Hula all of a sudden?!\n\nBefore she could get over her pure shock, Craig walked toward her reaching in his back pocket…She started to cry…He got on his knees and asked her to be his wife…The audience went crazy with glee as she said YES.\nShe says yes…then there is kissing…lots of kissing!:)\n \n \n \nThe happy couple…\n \n\n \n \n \n \n \n \n \n \n \nThe crowd was full of smiles and had many congratulations for the happy couple. It was one of the most romantic wedding proposals we have ever had the privilege of being a part of.\nWe wish Craig and Melissa a life time of happiness and look forward to providing Hula dancers for a Hawaii wedding in their future.  Mahalo Craig and Melissa, for allowing us to share in such a special and momentous occasion as your Hawaiian wedding proposal.\nA message from Craig…\nYou guys met all my crazy demands and put together a great SURPRISE WEDDING PROPOSAL. And it worked, she said yes! Thanks again.\n\t  Our Hula Dancers, ready to perform.The crowds builds…She says yes…then there is kissing…lots of kissing!:)The happy couple…"},
{"title": "Hawaiian Legends & Myths: Hi`iaka and Pele", "content": "Oct 20\n\t  Hawaiian Legends & Myths: Hi`iaka and Pele\n\t3 Comments »\n\t  \n\t\tFor our very first Blog entry, we would like to honor the Hawaiian Goddess sisters Hi`iakaikapoliopele and Pelehonuamea, in modern times commonly referred to as Hi`iaka and Pele… the legend brought to us by talented writer of Hawaiian myths and legends, Kimo Armitage:\nA mo`olelo (story) of Hi`iakaikapoliopele and Pelehonuamea\nHi`iakaikapoliopele is Pelehonuamea’s youngest sister and her closest confidant.  One day, Pelehonuamea tells her sisters, who live with her on the summit of Kilauea, that she would like to sleep and under no circumstances is she to be awakened; however, if Pelehonuamea must tend to an urgent matter, only her favorite sister Hi`iakaikapoliopele may wake her.\n“Sacred Fire of Pele” by Olga Shevchenko\nPelehonuamea sleeps for several days. Soon the sisters become frightened and want to wake her, but they also fear their older sister, so they pay her to her instructions.\nWhile Pelehonuamea is sleeping, her spirit leaves her body and is drawn to the sound of chanting and merriment on the island of Kaua`i.\nWhen Pelehonuamea nears the source of the chanting, she is immediately attracted to a handsome Hawaiian chief named Lohiauipo. Lohiauipo returns the attention.\nFor several days, Pelehonuamea and Lohiauipo enjoy each others company, while Hi`iakaikapoliopele dances in the Pandanus groves of Puna with her companion, Hopoe.\nAfter many nights together, Pelehonuamea tells Lohiauipo that she must return to her homeland. Lohiauipo is heartbroken, but Pelehonuamea tells him that she will send someone to bring him to her, and then she disappears into the ocean.\nWhen Pelehonuamea awakens from her spirit-traveling sleep, she summons all of her sisters and tells them about her adventures and her new love, Lohiauipo.  She asks her sisters if one of them could travel to Kaua`i and bring Lohiauipo back to her.  All the sisters decline.  They are afraid of the long journey and the numerous mo’o, lizard-like water creatures who can take the form of Humans.\n“Hi`iaka and the Mo`o” by Linda Rowell Stevens\nOnly the very young, inexperienced, and devoted Hi`iakaikapoliopele agrees to make this journey.  She does so with Pelehonuamea’s promise to guard her beloved forest of lehua trees and her companion Hopoe.\nOver the arduous journey, Hi`iakaikapoliopele as many challenges. The first challenge, which is the most deadly, takes place in the forest of Pana`ewa on the island of Hawai`i. Hi`iakaikapoliopele fights the dangerous mo’o named Pana`ewa for whom the forest is named.  She is almost killed, but she uses the sacred skirt and staff given to her by Pelehonuamea to kill Pane`ewa before it kills her.\nHi`iakaikapoliopele experiences many battles on her journey to Kaua`i, and with each battle, she becomes stronger and stronger until she eventually becomes a formidable goddess and is able to exercise the ultimate of godly powers, bringing the dead back to life.\nHi`iakaikapoliopele finds Lohiauipo on Kaua`i but the journey back to Kilauea takes longer than expected.\nWhen Hi`iakaikapoliopele finally returns to Kilauea, she discovers her impatient sister has burned her beloved lehua groves to the ground and killed Hopoe.  Hi`iakaikapoliopele vows revenge.  She digs a hole to connect the ocean to Pelehonuamea’s sacred fires.  Her plan – to extinguish her sister as her sister has extinguished the life of the the fragile Hopoe.\nKilauea fern photo by Kevin McCarthy\nThe pantheons of gods intervene, realizing that should either sister die, her death would wreak havoc on the natural order of life and growth.  The gods order a truce, and the sisters agree.\nAfter the volcanoes of Pelehonuamea create new land, among the first plants to grow are the beloved lehua tree and ferns of Hi`iakaikapoliopele.  The creation of new land is followed by the growth of new vegetation.  These sister-gods ensure that the life of the land continues.\nSource: Akua Hawai`i\nAuthor: Kimo Armitage\nCopyright 2005, Bishop Museum\n\t  “Sacred Fire of Pele” by Olga Shevchenko“Hi`iaka and the Mo`o” by Linda Rowell StevensKilauea fern photo by Kevin McCarthy"}
]